app/views/favorites/_favorite.html.erb

<div class="option_favorite" id="favorite-link-<%= @game.id %>">
  <% if current_user.favorites.find_by(game_id: game.id) %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."game_id" = ? LIMIT ?  [["user_id", 3], ["game_id", 7], ["LIMIT", 1]]