app/controllers/chats_controller.rb

  def create
    @game = Game.find(params[:game_id])
    @chat = Chat.new(chat_params)
    @chat.game_id = @game.id
    @chat.user_id = current_user.id
    if @chat.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "chats" ("user_id", "game_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["game_id", 5], ["comment", "good"], ["created_at", "2021-03-13 14:04:32.514064"], ["updated_at", "2021-03-13 14:04:32.514064"]]

  def destroy
    @game = Game.find(params[:game_id])
    chat = @game.chats.find(params[:id])
    chat.destroy
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "chats".* FROM "chats" WHERE "chats"."game_id" = ? AND "chats"."id" = ? LIMIT ?  [["game_id", 5], ["id", 1], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]