app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["game_id", 3], ["created_at", "2021-03-14 20:22:14.854506"], ["updated_at", "2021-03-14 20:22:14.854506"]]
---
  def favorite
    favorite = current_user.favorites.new(game_id: @game.id)
    favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."game_id" = ? LIMIT ?  [["user_id", 3], ["game_id", 7], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 11]]
---
  def unfavorite
    favorite = current_user.favorites.find_by(game_id: @game.id)
    favorite.destroy

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_variables
    @game = Game.find(params[:game_id])