app/controllers/games_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."game_id" = ?  [["game_id", 5]]
SELECT COUNT(*) FROM "chats" WHERE "chats"."game_id" = ?  [["game_id", 5]]
---
  def show
    @game = Game.find(params[:id])
    @chat = Chat.new
    @chats = @game.chats.page(params[:page]).per(10).reverse_order