app/controllers/games_controller.rb

SELECT  "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games"
---
  def index
    @games = Game.all.page(params[:page]).per(3).reverse_order

INSERT INTO "games" ("user_id", "image_id", "title", "introduction", "site_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)
    @game.user_id = current_user.id
    if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "games" SET "image_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["image_id", "11c83d2e4cd522a541adbf99421988256504ea1c08a3ec15897c1f20377a"], ["updated_at", "2021-03-14 20:45:33.910794"], ["id", 5]]
---
  def update
    @game = Game.find(params[:id])
    if @game.update(game_params)

SELECT "games".* FROM "games" INNER JOIN "favorites" ON "games"."id" = "favorites"."game_id" WHERE "favorites"."user_id" = ? ORDER BY "games"."created_at" DESC  [["user_id", 1]]
---
  def favorites
    @games = current_user.favorite_games.includes(:user).order(created_at: :desc)