app/controllers/users_controller.rb

  def show
    @user = User.find(current_user.id)
    @games = @user.games.all.page(params[:page]).per(3).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."user_id" = ? ORDER BY "games"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ?  [["user_id", 1]]